<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/xhtml;charset=UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=9"/>
<meta name="generator" content="Doxygen 1.8.9.1"/>
<title>MED fichier: Introduction</title>
<link href="tabs.css" rel="stylesheet" type="text/css"/>
<script type="text/javascript" src="jquery.js"></script>
<script type="text/javascript" src="dynsections.js"></script>
<link href="doxygen.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="top"><!-- do not remove this div, it is closed by doxygen! -->
<div id="titlearea">
<table cellspacing="0" cellpadding="0">
 <tbody>
 <tr style="height: 56px;">
  <td style="padding-left: 0.5em;">
   <div id="projectname">MED fichier
   </div>
  </td>
 </tr>
 </tbody>
</table>
</div>
<!-- end header part -->
<!-- Généré par Doxygen 1.8.9.1 -->
  <div id="navrow1" class="tabs">
    <ul class="tablist">
      <li><a href="index.html"><span>Documentation&#160;MED</span></a></li>
      <li class="current"><a href="pages.html"><span>Guides&#160;d'utilisation</span></a></li>
      <li><a href="modules.html"><span>Guides&#160;de&#160;référence</span></a></li>
    </ul>
  </div>
</div><!-- top -->
<div class="header">
  <div class="headertitle">
<div class="title">Introduction </div>  </div>
</div><!--header-->
<div class="contents">
<div class="textblock"><p><a class="anchor" id="____Introduction____"></a>  </p><h3><a class="anchor" id="1."></a><a class="anchor" id="2.1"></a>Pourquoi MED ?</h3>
<p>Les &eacute;changes de donn&eacute;es sont devenus une n&eacute;cessit&eacute; dans le cadre des &eacute;tudes de simulation multi-physiques faisant collaborer diff&eacute;rents logiciels de calcul scientifique. Pour r&eacute;aliser ces &eacute;changes, il est n&eacute;cessaire de d&eacute;velopper entre les codes des passerelles logicielles. Pour cela deux approches sont possibles. L'approche au cas par cas o&ugrave; pour chaque couple de code devant communiquer, on r&eacute;alise une passerelle sp&eacute;cifique et non r&eacute;utilisable. L'approche standardis&eacute;e qui consiste &agrave; r&eacute;aliser des passerelles logicielles &agrave; base de modules externes r&eacute;utilisables par diff&eacute;rents couples de codes. </p>
<p>La d&eacute;marche MED (Mod&eacute;lisation et Echange de Donn&eacute;es) s'inscrit dans cette seconde optique. </p>
<h3>Qu'est-ce que MED ?</h3>
<p>Cette d&eacute;marche initi&eacute;e par EDF R&amp;D &agrave; la fin des ann&eacute;es 90, a consist&eacute; d'une part &agrave; pr&eacute;ciser la nature des donn&eacute;es &eacute;chang&eacute;es pour d&eacute;finir un mod&egrave;le d'&eacute;change de donn&eacute;es et d'autre part d&eacute;velopper une biblioth&egrave;que informatique permettant de cr&eacute;er et de repr&eacute;senter les donn&eacute;es du mod&egrave;le commun dans des fichiers.</p>
<p>Le mod&egrave;le de donn&eacute;es MED offre une repr&eacute;sentation standardis&eacute;e des maillages et les champs de r&eacute;sultats. Ce mod&egrave;le est g&eacute;n&eacute;rique et r&eacute;pond aux besoins de beaucoup de codes de calculs scientifiques (thermo-m&eacute;canique, thermo-hydraulique, &eacute;lectromagn&eacute;tisme, etc). La biblioth&egrave;que MED d&eacute;velopp&eacute;e en C et offrant une API C et FORTRAN, permet de cr&eacute;er et lire les maillages et les champs tels que d&eacute;finis par le mod&egrave;le dans des fichiers au format HDF5 (<a href="http://www.hdfgroup.org/HDF5">http://www.hdfgroup.org/HDF5</a>). HDF5 est un format de fichier binaire, portable sur la plupart des syst&egrave;mes d'exploitation (en particulier UNIX, LINUX et WINDOWS).</p>
<p>HDF5 est &eacute;galement associ&eacute; &agrave; une biblioth&egrave;que informatique qui constitue un pr&eacute;-requis de la biblioth&egrave;que MED. Ces deux biblioth&egrave;ques sont &laquo;&#160;open source&#160;&raquo;, MED &eacute;tant diffus&eacute;e sous les termes de la licence L-GPL.</p>
<p>Depuis le d&eacute;but des ann&eacute;es 2000, MED est utilis&eacute;e pour standardiser les &eacute;changes de donn&eacute;es entre de nombreux codes de calcul scientifique en particulier &agrave; EDF et au CEA. MED est d'ailleurs depuis cette &eacute;poque co-propri&eacute;t&eacute; d'EDF et du CEA. MED constitue le mod&egrave;le d'&eacute;changes de donn&eacute;es de la plate-forme de simulation num&eacute;rique SALOME (<a href="http://www.salome-platform.org/">http://www.salome-platform.org</a>). Depuis 2001, SALOME est une plate-forme logicielle co-d&eacute;velopp&eacute;e par le CEA et EDF qui offre un environnement d'&eacute;tude int&eacute;gr&eacute; et standardis&eacute; pour les codes de calcul scientifique. </p>
<p><br />
<br />
 </p>
<p><br />
<br />
 </p>
<p><br />
<br />
 </p>
</div></div><!-- contents -->
<!-- start footer part -->
<hr class="footer"/><address class="footer"><small>
Généré le Lundi 10 Décembre 2018 18:40:48 pour MED fichier par &#160;<a href="http://www.doxygen.org/index.html">
<img class="footer" src="doxygen.png" alt="doxygen"/>
</a> 1.8.9.1
</small></address>
</body>
</html>
