<A NAME="____Introduction____">
</A>
<H3><A NAME="1."></A><A NAME="2.1"></A>Pourquoi MED ?</H3>
<P STYLE="margin-bottom: 0cm">Les &eacute;changes de donn&eacute;es
sont devenus une n&eacute;cessit&eacute; dans le cadre des &eacute;tudes
de simulation multi-physiques faisant collaborer diff&eacute;rents
logiciels de calcul scientifique. Pour r&eacute;aliser ces &eacute;changes,
il est n&eacute;cessaire de d&eacute;velopper entre les codes des
passerelles logicielles. Pour cela deux approches sont possibles.
L'approche au cas par cas o&ugrave; pour chaque couple de code devant
communiquer, on r&eacute;alise une passerelle sp&eacute;cifique et
non r&eacute;utilisable. L'approche standardis&eacute;e qui consiste
&agrave; r&eacute;aliser des passerelles logicielles &agrave; base de
modules externes r&eacute;utilisables par diff&eacute;rents couples
de codes. 
</P>
<P STYLE="margin-bottom: 0cm">La d&eacute;marche MED (Mod&eacute;lisation
et Echange de Donn&eacute;es) s'inscrit dans cette seconde optique. 
</P>
<H3>Qu'est-ce que MED ?</H3>
<P STYLE="margin-bottom: 0cm">Cette d&eacute;marche initi&eacute;e
par EDF R&amp;D &agrave; la fin des ann&eacute;es 90, a consist&eacute;
d'une part &agrave; pr&eacute;ciser la nature des donn&eacute;es
&eacute;chang&eacute;es pour d&eacute;finir un mod&egrave;le
d'&eacute;change de donn&eacute;es et d'autre part d&eacute;velopper
une biblioth&egrave;que informatique permettant de cr&eacute;er et de
repr&eacute;senter les donn&eacute;es du mod&egrave;le commun dans
des fichiers.</P>
<P STYLE="margin-bottom: 0cm">Le mod&egrave;le de donn&eacute;es MED
offre une repr&eacute;sentation standardis&eacute;e des maillages et
les champs de r&eacute;sultats. Ce mod&egrave;le est g&eacute;n&eacute;rique
et r&eacute;pond aux besoins de beaucoup de codes de calculs
scientifiques (thermo-m&eacute;canique, thermo-hydraulique,
&eacute;lectromagn&eacute;tisme, etc). La biblioth&egrave;que MED
d&eacute;velopp&eacute;e en C et offrant une API C et FORTRAN, permet
de cr&eacute;er et lire les maillages et les champs tels que d&eacute;finis
par le mod&egrave;le dans des fichiers au format HDF5
(<A HREF="http://www.hdfgroup.org/HDF5">http://www.hdfgroup.org/HDF5</A>).
HDF5 est un format de fichier binaire, portable sur la plupart des
syst&egrave;mes d'exploitation (en particulier UNIX, LINUX et
WINDOWS).</P>
<P STYLE="margin-bottom: 0cm">HDF5 est &eacute;galement associ&eacute;
&agrave; une biblioth&egrave;que informatique qui constitue un
pr&eacute;-requis de la biblioth&egrave;que MED. Ces deux
biblioth&egrave;ques sont &laquo;&nbsp;open source&nbsp;&raquo;, MED
&eacute;tant diffus&eacute;e sous les termes de la licence L-GPL.</P>
<P STYLE="margin-bottom: 0cm">Depuis le d&eacute;but des ann&eacute;es
2000, MED est utilis&eacute;e pour standardiser les &eacute;changes
de donn&eacute;es entre de nombreux codes de calcul scientifique en
particulier &agrave; EDF et au CEA. MED est d'ailleurs depuis cette
&eacute;poque co-propri&eacute;t&eacute; d'EDF et du CEA. MED
constitue le mod&egrave;le d'&eacute;changes de donn&eacute;es de la
plate-forme de simulation num&eacute;rique SALOME
(<A HREF="http://www.salome-platform.org/">http://www.salome-platform.org</A>).
Depuis 2001, SALOME est une plate-forme logicielle co-d&eacute;velopp&eacute;e
par le CEA et EDF qui offre un environnement d'&eacute;tude int&eacute;gr&eacute;
et standardis&eacute; pour les codes de calcul scientifique. 
</P>
<P><BR><BR>
</P>
<P><BR><BR>
</P>
<P><BR><BR>
</P>
</BODY>
</HTML>
